app/controllers/users_controller.rb

INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "password_digest" = '$2a$10$ZNw0kdZScvKRY5c7a/44lOsCeqWn1AgXEowcyELbt/nNmvHVHsTm.', "remember_token" = 'N6BgklZoJmqomnqLLPrz3w', "updated_at" = '2013-03-26 18:33:06.067980' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    #@users = User.all
    @users = User.paginate(page: params[:page])